# DuctFittingAndAccessoryPressureDropUIDataItem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIDataItem Class
Members See Also
---
Each duct fitting or duct accessory FamilyInstance has one DuctFittingAndAccessoryPressureDropUIDataItem.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
```

Visual Basic
---
```text
Public Class DuctFittingAndAccessoryPressureDropUIDataItem _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
```

# Remarks
One family instance has one UI data item. The UI data item contains a corresponding DuctFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI.Mechanical..::..DuctFittingAndAccessoryPressureDropUIDataItem
# See Also
DuctFittingAndAccessoryPressureDropUIDataItem Members
Autodesk.Revit.UI.Mechanical Namespace